Revit 2027 API
BuiltInFailures.ComponentRepeaterFailures Class
 Failures related to component repeaters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ComponentRepeaterFailures
Public NotInheritable Class ComponentRepeaterFailures
public ref class ComponentRepeaterFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ComponentRepeaterFailures = class end
The BuiltInFailures.ComponentRepeaterFailures type exposes the following members.
Properties
Name | Description
ComponentRepeater_InvalidFamilyOnReload |  Reloaded family not appropriate for repeater.
ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater |  There is only one component in this repeater.
Top
See Also
Reference
Autodesk.Revit.DB Namespace